package com.example.test31_3_64

import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle

class bmr : AppCompatActivity() {
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_bmr)

//        1. สำหรับผู้ชาย
//        BMR = 66 + (13.7 x น้ำหนักตัวเป็น กก.) + (5 x ส่วนสูงเป็น ซม.) – (6.8 x อายุ)
//        2. สำหรับผู้หญิง
//        BMR = 665 + (9.6 x น้ำหนักตัวเป็น กก.) + (1.8 x ส่วนสูงเป็น ซม.) – (4.7 x อายุ)

//        ออกกำลังกายน้อยมากหรือไม่ออกเลย : TDEE = 1.2 x BMR
//        ออกกำลังกาย 1-3 ครั้งต่อสัปดาห์ : TDEE = 1.375 x BMR
//        ออกกำลังกาย 4-5 ครั้งต่อสัปดาห์ : TDEE = 1.55 x BMR
//        ออกกำลังกาย 6-7 ครั้งต่อสัปดาห์ : TDEE = 1.7 x BMR
//        ออกกำลังกายวันละ 2 ครั้งขึ้นไป : TDEE = 1.9 x BMR
//        ค่า TDEE นี้นั่นสามารถนำไปใช้ฟิตหุ่นเพื่อลดน้ำหนัก(ลดไขมัน) หรือเพิ่มน้ำหนัก (เพิ่มกล้ามเนื้อ) เพื่อเพิ่มทรวดทรงให้ดูสมส่วนมากขึ้นก็ได้
//
//        - ต้องการฟิตหุ่น ลดไขมัน TDEE - 500
//        - ต้องการเพิ่มน้ำหนัก(กล้ามเนื้อ) TDEE + 500
//
//        ยกตัวอย่าง ถ้าต้องการลดน้ำหนัก แล้วมีค่า TDEE อยู่ที่ 2000 แคลอรี่
//        หากต้องการลดน้ำหนัก 2000 - 500 = 1500 ดังนั้น 1500 คือแคลอรี่ที่เราควรได้รับใน 1 วัน
//        หากต้องการเพิ่มน้ำหนัก 2000 + 500 = 2500 ดังนั้น 2500 คือแคลอรี่ที่เราควรได้รับใน 1 วัน
//
//        ปล. ตามหลักโภชนาการ ไม่ควรได้รับแคลอรี่ต่ำกว่า BMR

    }
}